Tekla Open API Reference for Tekla Structures 2025
Shape Methods
The ReinforcingBarFilterExpressions.Shape type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
ReinforcingBarFilterExpressions.Shape Class
Tekla.Structures.Filtering.Categories Namespace